Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/tax/income_tax/universal_social_charge.html.txt.tmx
Source language: en
Languages: ga

source: This service is now available through Revenue's myAccount Service
ga: Tá an tseirbhís seo ar fáil anois trí Sheirbhís moChúrsaí na gCoimisinéirí Ioncaim

source: You can also contact your local Revenue office for a review of your USC deductions
ga: Chomh maith leis sin, féadfaidh tú teagmháil a dhéanamh le hoifig áitiúil na gCoimisinéirí Ioncaim go ndéanfar athbhreithniú ar d’asbhaintí MSU

source: If you have become unemployed during the year you can reclaim any overpayments of income tax and USC using Revenue's tax repayment Form P50 (pdf)
ga: Má tá tú dífhostaithe i rith na bliana, féadfaidh tú aon ró-íocaíochtaí cáin ioncaim agus MSU a athéileamh trí leas a bhaint as Foirm P50 aisíocaíochta cánach na gCoimisinéirí Ioncaim (pdf)

source: They will deduct and pay it to Revenue on behalf of employees
ga: Asbhainfidh agus íocfaidh siad é leis na Coimisinéirí Ioncaim thar ceann fostaithe

source: Revenue will notify employers of the USC rates and thresholds to be applied for all employees
ga: Cuirfidh na Coimisinéirí Ioncaim fostóirí ar an eolas ar rátaí agus tairseacha MSU atá le cur i bhfeidhm do gach fostaí

source: You should inform Revenue of any changes in your circumstances (for example, if you get a medical card)
ga: Ba cheart duit na Coimisinéirí Ioncaim a chur ar an eolas ar aon athruithe a thagann ar do chúinsí (mar shampla, má fhaigheann tú cárta leighis)
